---
kind: enumMember
id: F:Autodesk.Revit.DB.FailureSeverity.None
enum: Autodesk.Revit.DB.FailureSeverity
source: html/d0cdffe3-22c5-b764-8090-5104f044b000.htm
---
# Autodesk.Revit.DB.FailureSeverity.None

Represents a failure-free state of a document. This value cannot be used as an argument to construct FailureMesasage.